# HasThermalProperties Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FamilySymbol..::..HasThermalProperties Method
FamilySymbol Class See Also
---
Identifies if this FamilySymbol can include thermal properties.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public bool HasThermalProperties()
```

Visual Basic
---
```text
Public Function HasThermalProperties As Boolean
```

Visual C++
---
```text
public:
bool HasThermalProperties()
```

# ### Return Value
True if the FamilySymbol can include thermal properties, false otherwise.
# See Also
FamilySymbol Class
Autodesk.Revit.DB Namespace